#include <map>
#include <sched.h>
#include <set>
#include <signal.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <string>
#include <sys/fcntl.h>
#include <sys/mman.h>
#include <sys/time.h>
#include <time.h>
#include <ucontext.h>
#include <unistd.h>
#include <unordered_map>
#include <vector>

#include "../asm-snippets/delay-loop..h"
#include "../asm-snippets/expose-ttbr-2..h"
#include "../asm-snippets/expose-ttbr-to-stack..h"
#include "../asm-snippets/expose-ttbr..h"
#include "../asm-snippets/infloop..h"
#include "../asm-snippets/irq-handler-store-magic-cookie..h"
#include "../asm-snippets/irq-handler-store-ttbr..h"
#include "../asm-snippets/new-irq-handler-part1..h"
#include "../asm-snippets/new-irq-handler-part2..h"
#include "../asm-snippets/new-vbar-entry-for-mrs..h"
#include "../asm-snippets/new-vbar-entry-special..h"
#include "../asm-snippets/new-vbar-entry..h"
#include "../asm-snippets/optimized-putc..h"
#include "../asm-snippets/wait-for-confirmation-receiver-part2..h"
#include "../asm-snippets/wait-for-confirmation-receiver..h"
#include "../asm-snippets/wait-for-confirmation..h"

#define MAGIC_WORD 0x140008b6b5fffff8
#define U64_MAX 0xffffffffffffffff
#define PAGE_SIZE (16384L)
#define PAGE_TABLE_PAGE_MASK (0xfffffff000UL)
#define MASK_T (0x1f)
#define MASK_N (0x1f << 5)

typedef unsigned u32;
typedef unsigned long u64;

class va_for_pa {
public:
  u64 pt;
  u64 va;
};

std::multimap<u64,va_for_pa> pa_to_va;

struct commpage {
  unsigned long code[0x3000/8];
  unsigned long mmio_master; /* 0x3e00 */
  unsigned long mmio_ttbr; /* 0x3e08 */
  unsigned long boot_master; /* 0x3e88 */
  unsigned long pt_wait_flag; /* 0x3f00 */
  unsigned long pt_stolen_flag; /* 0x3f08 */
  unsigned long mmio_self_ptr; /* 0x3fa0 */
  unsigned long mmio_offset; /* 0x3fa8 */
  unsigned long mmio_reg_ptr; /* 0x3fb0 */
  unsigned long mmio_read_va; /* 0x3fb8 */
  unsigned long mmio_frame; /* 0x3fc8 */
  unsigned long mmio_success; /* 0x3fd0 */
  unsigned long mmio_esr; /* 0x3fd8 */
  unsigned long mmio_ttbr0; /* 0x3fe0 */
  unsigned long mmio_ttbr1; /* 0x3fe8 */
  unsigned long mmio_far; /* 0x3ff0 */
  unsigned long mmio_elr; /* 0x3ff8 */
};

#define ARRAYELTS(x) ((sizeof(x)/sizeof((x)[0])))

static struct {
  void *mapped;
  unsigned long offset;
} mapping[32];

static int fd = -1;
static unsigned long ppage = 0xb90000000;

static inline void remap_memory(unsigned long off)
{
  if (fd < 0)
    fd = open("/dev/mem", O_RDWR);
  size_t i = 0;
  for (i = 0; i < ARRAYELTS(mapping); i++) {
    if (mapping[i].mapped == NULL) {
      mapping[i].mapped = mmap(NULL, 16384, PROT_READ|PROT_WRITE, MAP_SHARED, fd, off);
      if (mapping[i].mapped == MAP_FAILED)
	mapping[i].mapped = NULL;
      mapping[i].offset = off;
      return;
    }
  }
  i = random() % ARRAYELTS(mapping);
  munmap(mapping[i].mapped, 16384);
  mapping[i].mapped = NULL;
  mapping[i].offset = 0;
  remap_memory(off);
}

static void *remapped_addr(unsigned long off)
{
  asm volatile("isb");
  static long dummy = 0;
  for (size_t i = 0; i < ARRAYELTS(mapping); i++) {
